gregflores/convertedGraphicsTest/HAL_MSP432_320x240_ILI9341.c
/*
 * mcuLCD.c
 *
 *  Created on: Feb 19, 2017
 *      Author: Gregorio Flores
 */
#include "HAL_MSP432_320x240_ILI9341.h"

#include "msp.h"
#include "lcd.h"
#include "config.h"
#include "driverlib.h"
void HAL_LCD_SpiInit()
{

    MAP_GPIO_setAsOutputPin(LCD_DC_PORT,
                        LCD_DC_PIN);

    MAP_GPIO_setOutputLowOnPin(LCD_DC_PORT,
                           LCD_DC_PIN);

    MAP_GPIO_setAsOutputPin(LCD_CS_PORT,
                        LCD_CS_PIN);

    MAP_GPIO_setOutputLowOnPin(LCD_CS_PORT,
                           LCD_CS_PIN);
    //
    // Configure SPI peripheral.
    //
	MAP_GPIO_setAsPeripheralModuleFunctionOutputPin(LCD_MOSI_PORT,
                                                LCD_MOSI_PIN,
                                                GPIO_PRIMARY_MODULE_FUNCTION);

	MAP_GPIO_setAsPeripheralModuleFunctionInputPin(LCD_MISO_PORT,
                                                LCD_MISO_PIN,
												GPIO_PRIMARY_MODULE_FUNCTION);

	MAP_GPIO_setAsPeripheralModuleFunctionOutputPin(LCD_SCLK_PORT,
    											LCD_SCLK_PIN,
												GPIO_PRIMARY_MODULE_FUNCTION);

    eUSCI_SPI_MasterConfig spiMasterConfig =
    {
        EUSCI_SPI_CLOCKSOURCE_SMCLK,                      		// SMCLK Clock Source
        MAP_CS_getSMCLK(),                                  			// Get SMCLK frequency
        16000000,                                                	// SPICLK = 16 MHz
        EUSCI_SPI_MSB_FIRST,                             			// MSB First
		EUSCI_SPI_PHASE_DATA_CAPTURED_ONFIRST_CHANGED_ON_NEXT, 	// Phase //  EUSCI_B_SPI_PHASE_DATA_CHANGED_ONFIRST_CAPTURED_ON_NEXT
        EUSCI_SPI_CLOCKPOLARITY_INACTIVITY_LOW,         			// Low polarity
		EUSCI_SPI_3PIN                                   			// SPI Mode
    };

    SPI_initMaster(EUSCI_B0_BASE, &spiMasterConfig);
    SPI_enableModule(EUSCI_B0_BASE);

    SPI_clearInterruptFlag(EUSCI_B0_BASE,  EUSCI_B_SPI_RECEIVE_INTERRUPT);
}


void writeData(uint8_t data)
{
    uint8_t ui8Data;

    //
    // Calculate the high byte to transmit.
    //
    ui8Data = (uint8_t)(data >> 8);

    //
    // Wait for the transmit buffer to become empty.
    //
    while(!SPI_getInterruptStatus(LCD_EUSCI_MODULE,
                                  EUSCI_B_SPI_TRANSMIT_INTERRUPT))
    {
        ;
    }

    //
    // Transmit the high byte.
    //
    SPI_transmitData(LCD_EUSCI_MODULE,ui8Data);

    //
    // Calculate the low byte to transmit.
    //
    ui8Data = (uint8_t)(data & 0xff);

    //
    // Wait for the transmit buffer to become empty.
    //
    while(!SPI_getInterruptStatus(LCD_EUSCI_MODULE,
                                  EUSCI_B_SPI_TRANSMIT_INTERRUPT))
    {
        ;
    }

    //
    // Transmit the high byte.
    //
    SPI_transmitData(LCD_EUSCI_MODULE,ui8Data);
}


void writeCommand(uint8_t command)
{
    //
    // Wait for any SPI transmission to complete before setting the LCD_DC signal.
    //
    while(SPI_isBusy(LCD_EUSCI_MODULE))
    {
        ;
    }

    //
    // Set the LCD_DC signal low, indicating that following writes are commands.
    //
    GPIO_setOutputLowOnPin(LCD_DC_PORT, LCD_DC_PIN);

    //
    // Transmit the command.
    //
    SPI_transmitData(LCD_EUSCI_MODULE, command);

    //
    // Wait for the SPI transmission to complete before setting the LCD_SDC signal.
    //
    while(SPI_isBusy(LCD_EUSCI_MODULE))
    {
        ;
    }

    //
    // Set the LCD_SDC signal high, indicating that following writes are data.
    //
    GPIO_setOutputHighOnPin(LCD_DC_PORT,LCD_DC_PIN);
}


void delay(uint16_t msec)
{
	uint32_t i = 0;
    uint32_t time = (msec/ 1000) * (SYSTEM_CLOCK_SPEED / 15);

    for(i = 0; i < time; i++)
    {
        __NOP();
    }
}
